#+TITLE: Modernes C++\linebreak \small...für Programmierer \hfill Unit 05: =array=, =vector=,...,Smart-Pointer
#+AUTHOR: Dr. Günter Kolousek
#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Execushares
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

#+LATEX_HEADER:\usepackage{pgfpages}
# +LATEX_HEADER:\pgfpagesuselayout{2 on 1}[a4paper,border shrink=5mm]
# +LATEX: \mode<handout>{\setbeamercolor{background canvas}{bg=black!5}}
#+LATEX_HEADER:\usepackage{xspace}
#+LATEX: \newcommand{\cpp}{C++\xspace}
#+LATEX: \newcommand{\cppXVII}{C++17\xspace}
#+LATEX: \newcommand{\cppXIV}{C++14\xspace}

* =array= -- 3
#+header: :exports both :results output :tangle src/array2.cpp :flags -std=c++1y -Ofast
#+begin_src C++
#include <iostream>  // array2.cpp
#include <array>
using namespace std;
int main() {
    array<int, 5> arr{1, 2, 3};
    cout << "size: " << arr.size() << endl;
    for (auto i : arr) {
        cout << i << " ";
    }
}
#+end_src

#+RESULTS:
: size: 5
: 1 2 3 0 0


* =array= -- 5
#+header: :exports both :results output :tangle src/array4.cpp :flags -std=c++1y
#+begin_src C++
#include <iostream>  // array4.cpp
#include <array>
using namespace std;
int main() {
    array<int, 5> arr{1, 2, 3};
    cout << arr[10] << endl;
    try {
        cout << arr.at(10) << endl;
    } catch (const out_of_range& ex) {
        cout<<"out of range: "<<ex.what()<<endl;
    }
}
#+end_src

#+RESULTS:
: 1
: error 'out of range': array::at: __n (which is 10) >= _Nm (which is 5)

* =vector= -- 2
\vspace{1.5em}
#+header: :exports both :results output :tangle src/vector.cpp :flags -std=c++1y
#+begin_src C++
#include <iostream>  // vector.cpp
#include <vector>
using namespace std;
int main() {  vector<int> v{1, 2};
    cout << "size: " << v.size() << " cap: "
         << v.capacity() << endl;
    v.push_back(3); cout << "added 3 → size: "
      << v.size() << " cap: "<<v.capacity()<<endl;
    v.push_back(4); v.push_back(5);
    cout << "added 3, 4 → size: " << v.size()
         << " cap: " << v.capacity() << endl;
}
#+end_src

#+RESULTS:
: size: 2 cap: 2
: added 3 → size: 3 cap: 4
: added 3, 4 → size: 5 cap: 8

* =tuple=
\vspace{1em}
\small
#+header: :exports both :results output :tangle src/tuple.cpp :flags -std=c++1y
#+begin_src C++
#include <iostream>  // tuple.cpp
#include <tuple>
using namespace std;
using namespace std::literals;  // can be ommitted (maybe...)
int main() {
  auto key{make_tuple(1234,"Maxi Muster"s,'A')};
  get<0>(key) = 4711;  // look it will be modified
  // error if multiple identical types:
  cout << '(' << get<int>(key) << ", "
       << get<string>(key) << ", "
       << get<char>(key) << ')';
  int id;   string name;  char type;
  tie(id, name, type) = key; // tuple unpacking...
}
#+end_src

#+RESULTS:
: (4711, Maxi Muster, A)

* =shared_ptr= -- 4
\vspace{1.7em}
#+header: :exports both :results output :tangle src/sharedptr4.cpp :flags -std=c++1y -Ofast
#+BEGIN_SRC C++
#include <iostream>  // sharedptr4.cpp
#include <memory>
using namespace std;
struct Person {
    weak_ptr<Person> spouse;
    ~Person() { cout << "destructed!" << ' '; }
};
int main() {
  shared_ptr<Person> p1{make_shared<Person>()};
  shared_ptr<Person> p2{make_shared<Person>()};
  p1->spouse = p2;   p2->spouse = p1;
  cout<<p1.use_count()<<' '<<p2.use_count()<<endl;
}
#+END_SRC

#+RESULTS:
: 1 1
: destructed! destructed!

* =weak_ptr= -- 2
\vspace{1.7em}
#+header: :exports both :results output :tangle src/weakptr2.cpp :flags -std=c++1y -Ofast
#+BEGIN_SRC C++
#include <memory>    // weakptr2.cpp
#include <iostream>
using namespace std;
void use_ptr(weak_ptr<int> wpi) {
    cout << *wpi.lock() << ' ';
}
int main() {
    weak_ptr<int> wpi;
    auto spi{make_shared<int>(1)};
    wpi = spi;
    use_ptr(wpi);  // can be copied
    use_ptr(move(wpi));  // but also moved
    // cout << *wpi.lock() << endl;  // segfault!
}
#+end_src

#+RESULTS:
: 1 1

